#Здесь будут функции

def get_posts_all():
    """
    Возвращает посты
    """


def get_posts_by_user(user_name):
    """
    Возвращает посты определенного пользователя.
    Вызывает ошибку ValueError если пользователя нет и пустой список, если у пользователя нет комментов
    """


def get_comments_by_post_id(post_id):
    """
    Возвращает комментарии определенного поста
    Вызывает ошибку ValueError если такого поста нет и пустой список, если у поста нет комментов
    """


def search_for_posts(query):
    """
    Возвращает список постов по ключевому слову
    """


def get_post_by_pk(pk):
    """
    Возвращает один пост по его идентификатору.
    """